# 计算时间的下一秒

while True:
    h, m, s = map(int, input("请输入一个24小时制时间(时:分:秒): ").split(':'))
    if h >= 24 or h < 0 or m >= 60 or m < 0 or s >= 60 or s < 0:
        print('您输入的时间有误，请重新输入.')
    else:        
        t = h*3600 + m*60 + s + 1                                   # 先转化为秒
        _h = t // 3600 % 24; _m = t % 3600 // 60; _s = t % 3600 % 60     # 在转化为一般时间表示
        print("您输入时间的下一秒时间为: ", end='')
        print('{}:{:0>2d}:{:0>2d}'.format(_h, _m, _s))         # {:0>2d}:{:0>2d}:{:0>2d}空位以0填充
